//========================================================
//スコア画面の処理
//========================================================
#include "number.h"

//=========================================
//コンストラクタ
//=========================================
CNumber::CNumber()
{
}

//=========================================
//デストラクタ
//=========================================
CNumber::~CNumber()
{

}

//=========================================
//オブジェクトの初期化処理
//=========================================
void CNumber::Init()
{
	// オブジェクトの初期化
	CObject2D::Init();

	//サイズの設定
	CObject2D::SetSize(D3DXVECTOR3(50.0f, 80.0f,0.0f));

	// テクスチャの設定
	CObject2D::SetTexture(CTexture::LABEL_Number);
}

//=========================================
//オブジェクトの更新処理
//=========================================
void CNumber::Update()
{
}

//=========================================
//オブジェクトの終了処理
//=========================================
void CNumber::Uninit()
{
	CObject2D::Uninit();
}

//=========================================
//オブジェクトの描画処理
//=========================================
void CNumber::Draw()
{
	CObject2D::Draw();
}

//=========================================
//オブジェクトのクリエイト
//=========================================
CNumber* CNumber::Create(const D3DXVECTOR3 &pos)
{
	CNumber* pCNumber = nullptr;

	pCNumber = new CNumber;

	if (pCNumber != nullptr)
	{
		pCNumber->Init();
		pCNumber->SetPos(pos);
	}

	return pCNumber;
}

//========================================================
//数字の設定処理
//========================================================
void CNumber::Set(int nDigits)
{
	float PatternSize = 1.0f / 10.0f;
	SetVtxTex(D3DXVECTOR2(nDigits * PatternSize,nDigits * PatternSize+PatternSize),D3DXVECTOR2(0.0f,1.0f));
}
