//======================================================
//
// シールドの処理
// Author : Sato Teruto
//
//======================================================

//--------------------------
// インクルード
//--------------------------
#include "shield.h"

//================================
// コンストラクタ
//================================
CShield::CShield()
{

}

//================================
// デストラクタ
//================================
CShield::~CShield()
{

}

//================================
// 初期化
//================================
void CShield::Init()
{
	CModel::Init();

	CModel::SetPos(m_defaultPos);
}

//================================
// 終了
//================================
void CShield::Uninit()
{
	CModel::Uninit();
}

//================================
// 更新
//================================
void CShield::Update()
{
	CModel::Update();
}

//================================
// 描画
//================================
void CShield::Draw()
{
	CModel::Draw();
}

//================================
// 生成
//================================
CShield* CShield::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot)
{
	CShield *pShield = nullptr;

	//----------------------------------
	// ポリゴンの生成と初期化
	//----------------------------------
	pShield = new CShield;	//生成

	if (pShield != nullptr)
	{//NULLチェック
		//メンバ変数に代入
		pShield->m_defaultPos = pos;	//初期位置
		pShield->m_rot = rot;			//向き
		pShield->SetLabel(CFileXManager::LABEL_BAMBOO);	//モデル
		
		//初期化
		pShield->Init();
	}

	return pShield;
}